var Fontmin = require('fontmin');//引入插件，当第一步中，使用全局下载的插件，这里路径要注意匹配，否则后面运行时会报找不到模块的错误，所以建议使用第二种：下载到当前项目的依赖中，本文件（fontmin.js）也建在当前项目目录下
 
var srcPath = 'font/FZFWZhuZGDSHJW.ttf'; // 字体源文件路径，需要保证该ttf文件存在
var destPath = '/fontmin';    // 字体输出路径
var text = '巍巍大别山，映照着英雄儿女的烈火青春金寨县，隶属于安徽省六安市，位于皖西边陲、大别山腹地，地处三省七县二区结合部。西、南两面与河南省、湖北省毗邻，总面积3814平方千米。'
'金寨县是安徽省面积最大、人口最多的山区县和旅游资源大县，也是中国第二大将军县，被誉为“红军的摇篮、将军的故乡”，是革命老区。209、210省道纵贯南北，临近312国道；梅山水库、响洪甸水库可常年通航。'
'在这块土地上，先后走出了59位开国将军、600多位共和国的高级将领，革命薪火在这里生生不息。习近平总书记在2016年4月24日亲临金寨视察，不仅对金寨老区人民为中国革命和建设做出的巨大牺牲和贡献给予了充分肯定和高度赞扬，并对红色文化资源的开发利用、红色基因的传承弘扬做出了重要指示。'
'旅行路线这里暂时没有图片哦我们在这里提供了一条比较好的金寨旅游路线。沿着我们的路线，就可以一览金寨的红色遗迹，体会那段红色岁月。'
'从抵达【金寨火车站】的那一刻开始，我们的旅途就开始了。我们先到达了红军广场，看着高耸的革命烈士纪念塔，瞻仰着红军纪念堂。其后，我们又来到了【<b>梅山水库</b>】，感受着具有综合效益的大型水利水电工程切实发挥的作用。告别了梅山水库，我们前往【<b>天堂寨</b>】。天堂寨古称衡山，又名多云山，是大别山脉第二高峰。它雄踞于皖鄂大别山主峰接壤处，自古为兵家必争之处，帝王巡幸之所，名人登临之境。'
'然而，我们的旅途还有很远很远……'
'重走金寨百年红色历史'
'调研成果'
'我们制作了一款[吃金币]的游戏，在游戏的过程中你能够领略到金寨各地的美景，聆听着悦耳的山歌《八月桂花遍地开》。<br><br>随着吃金币到达所要求的的数量，你就能进入金寨的下一个场景，体会另一种风光。'
'游戏访金寨开始结束'
'【操作方式】 A 向左移动 D 向右移动【游戏说明】吃金币，获得积分○获得足够的积分以通关旅途中体会金寨美景倾听悦耳的山歌我们在金寨，等待你的到来'
'金寨火车站金寨县高铁站，可以选择直接乘坐高铁到【站】，开始你的金寨之旅'
'红军广场红色旅途第一站———'
'梅山水库梅山水库位于鄂、豫、皖三省交界处的大别山腹地、淮河支流史河上游，坐落于有“红军故乡、将军摇篮”之誉的安徽省金寨县县城南端。它位于史河上游，坝址在安徽省金寨县梅山镇大小梅山之间。北距史河入淮口130km，是一座以防洪、灌溉为主，兼有发电等综合效益的大型水利水电工程。'
'悬剑山风景区清人陈自卿聚义士起义，置兵书、挂宝剑于峰顶，以示天意，故尔得名。悬剑山覆盖面积25平方公里，有景点50余处，其中待命名30余处，植被完整，物种多样，具有丰富的旅游资源。2000年，县宗教局、旅游局批准，悬剑山为宗教旅游区。'
'天堂寨是大别山第二高峰，由十一届全国人大常委会委员长吴邦国先生题字。位于安徽省金寨县与湖北省罗田县交界的地区，有“华东最后一片原始森林、植物的王国、花的海洋”的美称。'
'燕子河大峡谷燕子河大峡谷位于安徽省六安市金寨县境内，由著名书画家启功先生题字。与华东最后一片原始森林天堂寨毗邻，峡谷奇峡绵延，以险崖、奇石、幽谷、秀水而著称'
'燎原星火，两大起义'
'立夏节起义'
'1929年5月6日（农历立夏节），在中共商罗麻特别区委的领导下，安徽金寨（当时属河南省商城县管辖爆发了声势浩大的立夏节起义（也称商南起义），在新民主主义革命史上留下了重要一笔。这次起义是鄂豫皖地区三大起义之一，也是首次取得全面胜利的革命武装起义，沉重地打击了商南地区的反动势力，极大地鼓舞了鄂豫皖边区党组织和人民群众开展武装斗争的信心和决心，在我党我军的历史上具有重要的意义。立夏节起义为红军建设注入鲜活的力量。1929年5月9日，立夏节起义胜利后的第3天，各路起义武装就会师在金寨斑竹园朱氏祠，成立了中国工农红军第11军第32师。1930年3月，中共中央决定将红32师和稍后同在金寨成立的中国工农红军第11军第33师与先期在湖北成立的第31师，合编为中国工农红军第1军，直属中央军委指挥。1931年1月，红1军与红15军又合编为中国工农红军第4军。同年11月7日，红4军与同在金寨成立的红25军组建成中国工农红军第四方面军。可以说，立夏节起义所诞生的红32师是大别山区组建最早的红军队伍之一，是中国工农红军第11军、第1军、第4军和红四方面军的重要组成部分，是八路军129师、中国人民解放军第71、77、78集团军的重要源头之一。'
'1929/5/60123456789'
'六霍起义1929年继黄麻、商南两大起义之后，以六安、霍山两县为中心，以农民暴动为主体，与民团兵变相结合的六霍起义，在鄂豫皖边区又一次大规模爆发。在农民暴动的风暴中，一些为我党控制的民团相继起义。六安县徐家集、江店、霍邱县乌龙庙等处民团起义，开辟了游击区，形成以农民暴动为主体与民团起义相结合的六霍大暴动。六霍起义创建的中国工农红军第十一军第三十三师，是鄂豫皖边区红军的三大主力之一，成为巩固和扩大皖西革命根据地的主力。'
'立夏节起义旧址六霍起义旧址红十一军三十二师成立旧址'
'红军改编，反剿斗争'
'工农红军第一军诞生鄂豫皖红军改编结束1930年4月初，党中央通过了红军改编决议，并建立了红一军军部，军长许继慎，政治委员曹大骏，副军长徐向前，政治部主任熊受暄。下设3个师、一个独立旅。全军共2100多人。又将六霍地区的部分游击队和潜山清水寨起义时建立的工农革命军集中，成立了中央独立第一师、第二师，到此，鄂豫皖红军改编结束。鄂豫皖边特委和红一军的组成，使鄂东北、豫东南、皖西北3块革命根据地和3支红军结成一体，整个鄂豫皖边区的革命斗争完全统一起来。  6月，正式成立了鄂豫皖边特区苏维埃政府，甘元景任主席，标志着鄂豫皖苏区发展到了一个崭新的阶段。8月的三个月中，红一军各师先后攻克霍山、英山、罗田、云梦4座县城，发展到5000多人。更重要的是红军在作战中，经受了锻炼，军事素质得到了很大提高，并积累了战斗经验。'
'第一次反“围剿”斗争胜利红军第四军的建立1930年冬，蒋介石对各根据地红军进行大规模“围剿”。党中央11月底派曾中生到鄂豫皖根据地担任特委书记兼军委主席，曾中生在黄安七里坪召开特委和附近县委书记紧急会议，成立了鄂豫皖临时特委和临时军事委员会，统一领导指挥根据地反“围剿”斗争。红一军从鄂东回师皖西，12月14日收复金家寨。到年底，皖西沦陷的广大农村、集镇全部恢复。到此，历时两个月的皖西反“围剿”斗争宣告结束。皖西反“围剿”斗争的胜利，使红军学到了运动战术。这是鄂豫皖红军战略战术史上的一个重大发展。红一军于1931年1月中旬，在商城长竹园与红十五军会合。遵照中央指示，合编为中国工农红军第四军，军长邝继勋，政治委员余笃三，参谋长徐向前，政治部主任曹大骏。原红一军第二师与红十五军第三团合编为红四军第十一师，师长许继慎，政治委员庞永俊，副师长周维炯。改编后的红四军，直接由鄂豫皖特委领导，改善了红军与地方党委的关系。红四军的成立，加速了粉碎敌人第一次“围剿”的进程。皖西的红四军独立团于2月初改为中国工农红军教导第二师，与成立后发动了霍邱南乡的武装起义，使六霍边区根据地得以向北发展。1931年2月初正式组成中区鄂豫皖特区委员会和军事委员会、鄂豫皖特区苏维埃政府。此后，红四军在巩固根据地的同时诱敌出动，同时皖西的红军教导师也获得了连战告捷的大胜利。3月24日教导二师在麻埠歼灭六安团匪。第一次反“围剿”全胜。'
'第二次反“围剿”斗争胜利鄂豫皖特委探明敌人第二次“围剿”部署，决定集中主力红军东进。红十一师及红十师二十九团于4月23日在金寨与红十二师会合，25日敌在皖西地区的第一次“围剿”宣告失败。5月底二次反“围剿”胜利，红军和根据地得到了大发展。'
'第三次反“围剿”斗争胜利红四方面军成立1931年鄂豫皖苏区人民开展了扩军、拥军活动，在麻埠成立了中国工农红军第二十五军，军长邝继勋，政委王平章。11月7日，中国工农红军第四方面军在黄安七里坪成立，下辖红四军和红二十五军，总指挥徐向前、政治委员陈昌浩、政治部主任刘士奇，红四军军长、政委分别由徐向前、陈昌浩兼任。九一八事变后，蒋介石不去抗日，却亲自布置对鄂豫皖苏区的第三次“围剿”经黄安战役、商、潢战役、苏家埠战役、潢光战役，到6月中旬，鄂豫皖红军第三次反“围剿”彻底胜利，红四方面军主力发展到两个军、6个师、1个少共国际团，连同3个独立师，共45000多人。拥有商城、红安、英山、罗田、霍山、广济6座县城，建立了26个县级革命政权，形成了鄂豫皖苏区的极盛时期。'
'第四次反“围剿”失败，红军主力西进川陕'
'5月22日，蒋介石担任鄂豫皖剿匪总司令，李济琛为副司令，于7月上旬陆续开始“围剿”活动。这时，在鄂豫皖根据地，以张国焘为代表的“左”倾机会主义领导者们对客观形势作出了完全错误的估计，9月20日敌攻陷金家寨。整个鄂豫皖苏区根据几乎全部轮陷。而张国焘则由“左”倾盲动转为“右”倾怯敌。10月上旬，红军主力返回红安地区。张国焘10月10日在河口地区的黄柴畈召开高级军事会议讨论军事行动。会上最后决定：鄂豫皖省委书记沈泽民留下，和尚在皖西分局的郭述申、高敬亭以及徐宝珊等人一起，在鄂豫皖苏区坚持斗争。11日晚，张国焘率方面军主力离开鄂豫皖苏区，向西转移，进入川陕地区。此后开始了红军的万里长征。1936年10日，红二方面军到达会宁县城，红一、二、四方面军胜利会师。'
'金寨县革命博物馆红军广场烈士陵园'
'国共合作，抗日救亡抗战运动第一个阶段“九一八”事变后，中国共产党面对日本的大规模侵略，最早发起全民族抗战号召。1933年，从大别山区金寨县等地走到川陕地区的红四方面军，就唱着《打倒帝国主义歌》：“我先把帝国打倒，再要把军阀肃清，要把豪绅铲除，再要把土地平分，平分呀，努力工作啊，到那时候，人人平等。”正因为抗日的战略需要，红25军2980人从金寨县打着“中国工农红军北上抗日第二支先遣队”红旗，进行了伟大长征，胜利到达陕北。红军增加到3400人，这不包括留在豫鄂陕根据地的700人游击队。红25军成为红军北上抗日的“长征先锋”。期间，在金家寨、麻埠、流波等地，金寨县人民进行反对日本帝国主义的宣传教育等，召开会议，发表宣言，号召广大党员、青年学生团员和广大群众立即行动起来，掀起了第一个阶段的抗战救亡运动。'
'抗日战争第二个阶段在“七.七”卢沟桥事变之后，中国共产党在中华民族生死存亡的关键时刻，毅然捐弃前嫌，推动国民党接受团结抗日主张，国共两党合作抗日达成协议，形成了抗日民族统一战线。金寨商南地区革命武装编入新四军四支队。四支队在流波镇集中后，成立了军政委员会，高敬亭负责支队的全面工作。同时，四支队在桃岭乡秦家湾建立兵站，后迁到张家湾，最后迁到花石乡汪家老屋。同时，中共安徽省委工委、鄂豫皖区党委迁到境内，具体领导了大别山区的抗日明主运动，'
'三在1943年元旦前后，金寨县军民不屈不挠，奋力抗击，进行了一系列抗日斗争。为了减少不必要的摩擦，中国共产党一方面对桂系顽固派破坏抗战作斗争，另一方面坚决维护抗日民族统一战线，顾大局，识大体，进了艰难的反顽、反逆流斗争。1939年冬，国民党反动派掀起了更大规模的反共高潮，桂系势力开始在金家寨清查迫害进步人士。大批共产党员和革命知识分子纷纷向皖东、淮北新四军占领地区转移。'
'金寨县是安徽省抗日战争的中心日本军国主义的野蛮侵略，激起中国人民的奋勇抵抗。“九一八”事变成为中国人民抗日战争的起点，并揭开了世界反法西斯战争的序幕。“七七”事变成为中国全民族抗战的开端，由此开辟了世界反法西斯战争的东方主战场。金寨县的抗日战争历史是中国伟大的反法西斯抗日战争的重要组成部分，也是大别山辉煌历史的一个非常重要阶段。'
'安徽抗日战争历史展馆红二十八军驻地旧址驱散黑暗，解放曙光内战爆发，中原突围千里跃进，解放金寨'
'1946年6月，蒋介石公然撕毁停战协议，发动全面内战。解放战争的序幕由此拉开。中原军区一纵一旅在旅长皮定均的指挥下，采取“声东击西”的疑兵战术，掩护军区主力部队越过平汉路、向西前进。皮旅与主力相背而行，穿越金寨、突出重围，胜利到达苏皖解放区'
'年6月至8月底，刘伯承、邓小平率领的晋冀鲁豫野战军千里跃进大别山。刘邓大军的三纵八旅攻克了金家寨，解放了流波疃、麻埠；组建了中共金寨县委和民主政府。自此，“立煌县”改名为金寨县。金寨儿女多壮志，血沃中华铸丰碑。在中国革命的各个历史时期，这里的革命红旗始终不倒、高高飘扬。这里是人民军队的重要发源地之一，在中国人民解放军的18个集团军中，至少有6个集团军有着金寨红军的血脉。金寨人民以“忠诚、奉献、紧跟党走”的精神，在中国革命的史诗中写下了壮丽的篇章！'
'大别山天堂寨刘邓大军千里跃进大别山前方指挥部'
;

//这里进行配置需要用到的字符，可以是中文或英文字母
//读取Home.vue中全部内容

// 初始化
var fontmin = new Fontmin()
    .src(srcPath)               // 输入配置
    .use(Fontmin.glyph({        // 字型提取插件
        text: text              // 所需文字
    }))
    .use(Fontmin.ttf2eot())     // eot 转换插件
    .use(Fontmin.ttf2woff())    // woff 转换插件     
    .use(Fontmin.ttf2svg())     // svg 转换插件
    .use(Fontmin.css())         // css 生成插件
    .dest(destPath);            // 输出配置
 
// 执行
fontmin.run(function (err, files, stream) {
 
    if (err) {                  // 异常捕捉
        console.error(err);
    }
 
    console.log('done');        // 成功
});