[
    {
    "id" : 1 ,
    "name" : "燎原星火，两大起义",
    "events":[
        {
            "eventName":"立夏节起义",
            "eventContent":"  1929年5月6日（农历立夏节），在中共商罗麻特别区委的领导下，安徽金寨（当时属河南省商城县管辖爆发了声势浩大的立夏节起义（也称商南起义），在新民主主义革命史上留下了重要一笔。这次起义是鄂豫皖地区三大起义之一，也是首次取得全面胜利的革命武装起义，沉重地打击了商南地区的反动势力，极大地鼓舞了鄂豫皖边区党组织和人民群众开展武装斗争的信心和决心，在我党我军的历史上具有重要的意义。立夏节起义为红军建设注入鲜活的力量。1929年5月9日，立夏节起义胜利后的第3天，各路起义武装就会师在金寨斑竹园朱氏祠，成立了中国工农红军第11军第32师。1930年3月，中共中央决定将红32师和稍后同在金寨成立的中国工农红军第11军第33师与先期在湖北成立的第31师，合编为中国工农红军第1军，直属中央军委指挥。1931年1月，红1军与红15军又合编为中国工农红军第4军。同年11月7日，红4军与同在金寨成立的红25军组建成中国工农红军第四方面军。可以说，立夏节起义所诞生的红32师是大别山区组建最早的红军队伍之一，是中国工农红军第11军、第1军、第4军和红四方面军的重要组成部分，是八路军129师、中国人民解放军第71、77、78集团军的重要源头之一。",
            "eventTime":"1929/5/6"
        },{
            "eventName":"六霍起义",
            "eventContent":"1929年继黄麻、商南两大起义之后，以六安、霍山两县为中心，以农民暴动为主体，与民团兵变相结合的六霍起义，在鄂豫皖边区又一次大规模爆发。在农民暴动的风暴中，一些为我党控制的民团相继起义。六安县徐家集、江店、霍邱县乌龙庙等处民团起义，开辟了游击区，形成以农民暴动为主体与民团起义相结合的六霍大暴动。六霍起义创建的中国工农红军第十一军第三十三师，是鄂豫皖边区红军的三大主力之一，成为巩固和扩大皖西革命根据地的主力。",
            "eventTime":"1929/11/7"
        }
    ],
    "ruins":[
        {
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0Vi9K.jpg","https://z3.ax1x.com/2021/08/12/f0VCh6.jpg","https://z3.ax1x.com/2021/08/12/f0V9tx.jpg"],
            "ruinsName":"立夏节起义旧址"
        },{
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0ZPVs.jpg","https://z3.ax1x.com/2021/08/12/f0Z9bj.jpg"],
            "ruinsName":"六霍起义旧址"
        },{
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0ZmMF.jpg"],
            "ruinsName":"红十一军三十二师成立旧址 "
        }
    ]
    },{
    "id" : 2 ,
    "name" : "红军改编，反剿斗争",
    "events":[
        {
            "eventName":"工农红军第一军诞生鄂豫皖红军改编结束",
            "eventContent":"  1930年4月初，党中央通过了红军改编决议，并建立了红一军军部，军长许继慎，政治委员曹大骏，副军长徐向前，政治部主任熊受暄。下设3个师、一个独立旅。全军共2100多人。又将六霍地区的部分游击队和潜山清水寨起义时建立的工农革命军集中，成立了中央独立第一师、第二师，到此，鄂豫皖红军改编结束。鄂豫皖边特委和红一军的组成，使鄂东北、豫东南、皖西北3块革命根据地和3支红军结成一体，整个鄂豫皖边区的革命斗争完全统一起来。  6月，正式成立了鄂豫皖边特区苏维埃政府，甘元景任主席，标志着鄂豫皖苏区发展到了一个崭新的阶段。8月的三个月中，红一军各师先后攻克霍山、英山、罗田、云梦4座县城，发展到5000多人。更重要的是红军在作战中，经受了锻炼，军事素质得到了很大提高，并积累了战斗经验。",
            "eventTime":"1930/4/1"
        },{
            "eventName":"第一次反“围剿”斗争胜利红军第四军的建立",
            "eventContent":"1930年冬，蒋介石对各根据地红军进行大规模“围剿”。党中央11月底派曾中生到鄂豫皖根据地担任特委书记兼军委主席，曾中生在黄安七里坪召开特委和附近县委书记紧急会议，成立了鄂豫皖临时特委和临时军事委员会，统一领导指挥根据地反“围剿”斗争。红一军从鄂东回师皖西，12月14日收复金家寨。到年底，皖西沦陷的广大农村、集镇全部恢复。到此，历时两个月的皖西反“围剿”斗争宣告结束。皖西反“围剿”斗争的胜利，使红军学到了运动战术。这是鄂豫皖红军战略战术史上的一个重大发展。红一军于1931年1月中旬，在商城长竹园与红十五军会合。遵照中央指示，合编为中国工农红军第四军，军长邝继勋，政治委员余笃三，参谋长徐向前，政治部主任曹大骏。原红一军第二师与红十五军第三团合编为红四军第十一师，师长许继慎，政治委员庞永俊，副师长周维炯。改编后的红四军，直接由鄂豫皖特委领导，改善了红军与地方党委的关系。红四军的成立，加速了粉碎敌人第一次“围剿”的进程。皖西的红四军独立团于2月初改为中国工农红军教导第二师，与成立后发动了霍邱南乡的武装起义，使六霍边区根据地得以向北发展。1931年2月初正式组成中区鄂豫皖特区委员会和军事委员会、鄂豫皖特区苏维埃政府。此后，红四军在巩固根据地的同时诱敌出动，同时皖西的红军教导师也获得了连战告捷的大胜利。3月24日教导二师在麻埠歼灭六安团匪。第一次反“围剿”全胜。",
            "eventTime":"1931/1/1"
        },{
            "eventName":"第二次反“围剿”斗争胜利",
            "eventContent":"鄂豫皖特委探明敌人第二次“围剿”部署，决定集中主力红军东进。红十一师及红十师二十九团于4月23日在金寨与红十二师会合，25日敌在皖西地区的第一次“围剿”宣告失败。5月底二次反“围剿”胜利，红军和根据地得到了大发展。",
            "eventTime":"1931/4/23"
        },{
            "eventName":"第三次反“围剿”斗争胜利红四方面军成立",
            "eventContent":"1931年鄂豫皖苏区人民开展了扩军、拥军活动，在麻埠成立了中国工农红军第二十五军，军长邝继勋，政委王平章。11月7日，中国工农红军第四方面军在黄安七里坪成立，下辖红四军和红二十五军，总指挥徐向前、政治委员陈昌浩、政治部主任刘士奇，红四军军长、政委分别由徐向前、陈昌浩兼任。九一八事变后，蒋介石不去抗日，却亲自布置对鄂豫皖苏区的第三次“围剿”经黄安战役、商、潢战役、苏家埠战役、潢光战役，到6月中旬，鄂豫皖红军第三次反“围剿”彻底胜利，红四方面军主力发展到两个军、6个师、1个少共国际团，连同3个独立师，共45000多人。拥有商城、红安、英山、罗田、霍山、广济6座县城，建立了26个县级革命政权，形成了鄂豫皖苏区的极盛时期。",
            "eventTime":"1931/11/7"
        },{
            "eventName":"第四次反“围剿”失败，红军主力西进川陕",
            "eventContent":"5月22日，蒋介石担任鄂豫皖剿匪总司令，李济琛为副司令，于7月上旬陆续开始“围剿”活动。这时，在鄂豫皖根据地，以张国焘为代表的“左”倾机会主义领导者们对客观形势作出了完全错误的估计，9月20日敌攻陷金家寨。整个鄂豫皖苏区根据几乎全部轮陷。而张国焘则由“左”倾盲动转为“右”倾怯敌。10月上旬，红军主力返回红安地区。张国焘10月10日在河口地区的黄柴畈召开高级军事会议讨论军事行动。会上最后决定：鄂豫皖省委书记沈泽民留下，和尚在皖西分局的郭述申、高敬亭以及徐宝珊等人一起，在鄂豫皖苏区坚持斗争。11日晚，张国焘率方面军主力离开鄂豫皖苏区，向西转移，进入川陕地区。此后开始了红军的万里长征。1936年10日，红二方面军到达会宁县城，红一、二、四方面军胜利会师。",
            "eventTime":"1932/5/22"
        }
    ],
    "ruins":[
        {
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0KL5j.jpg","https://z3.ax1x.com/2021/08/12/f0KXPs.jpg"],
            "ruinsName":"金寨县革命博物馆"
        },{
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0Myzq.jpg","https://z3.ax1x.com/2021/08/12/f0MsWn.jpg","https://z3.ax1x.com/2021/08/12/f0MrJs.jpg"],
            "ruinsName":"红军广场"
        },{
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0QP6P.jpg","https://z3.ax1x.com/2021/08/12/f0Qkm8.jpg"],
            "ruinsName":"金寨县烈士陵园"
        }
    ]
    },{
    "id" : 3 ,
    "name" : "国共合作，抗日救亡",
    "events":[
        {
            "eventName":"金寨县抗战运动第一个阶段",
            "eventContent":"  “九一八”事变后，中国共产党面对日本的大规模侵略，最早发起全民族抗战号召。1933年，从大别山区金寨县等地走到川陕地区的红四方面军，就唱着《打倒帝国主义歌》：“我先把帝国打倒，再要把军阀肃清，要把豪绅铲除，再要把土地平分，平分呀，努力工作啊，到那时候，人人平等。”正因为抗日的战略需要，红25军2980人从金寨县打着“中国工农红军北上抗日第二支先遣队”红旗，进行了伟大长征，胜利到达陕北。红军增加到3400人，这不包括留在豫鄂陕根据地的700人游击队。红25军成为红军北上抗日的“长征先锋”。期间，在金家寨、麻埠、流波等地，金寨县人民进行反对日本帝国主义的宣传教育等，召开会议，发表宣言，号召广大党员、青年学生团员和广大群众立即行动起来，掀起了第一个阶段的抗战救亡运动。",
            "eventTime":"1931/9-1937/7"
        },{
            "eventName":"金寨县抗日战争第二个阶段",
            "eventContent":"在“七.七”卢沟桥事变之后，中国共产党在中华民族生死存亡的关键时刻，毅然捐弃前嫌，推动国民党接受团结抗日主张，国共两党合作抗日达成协议，形成了抗日民族统一战线。金寨商南地区革命武装编入新四军四支队。四支队在流波镇集中后，成立了军政委员会，高敬亭负责支队的全面工作。同时，四支队在桃岭乡秦家湾建立兵站，后迁到张家湾，最后迁到花石乡汪家老屋。同时，中共安徽省委工委、鄂豫皖区党委迁到境内，具体领导了大别山区的抗日明主运动，",
            "eventTime":"1937/7-1939/10"
        },{
            "eventName":"金寨县抗日战争第三阶段",
            "eventContent":"在1943年元旦前后，金寨县军民不屈不挠，奋力抗击，进行了一系列抗日斗争。为了减少不必要的摩擦，中国共产党一方面对桂系顽固派破坏抗战作斗争，另一方面坚决维护抗日民族统一战线，顾大局，识大体，进了艰难的反顽、反逆流斗争。1939年冬，国民党反动派掀起了更大规模的反共高潮，桂系势力开始在金家寨清查迫害进步人士。大批共产党员和革命知识分子纷纷向皖东、淮北新四军占领地区转移。",
            "eventTime":"1939/11-1945/8"
        },{
            "eventName":"金寨县是安徽省抗日战争的中心",
            "eventContent":"日本军国主义的野蛮侵略，激起中国人民的奋勇抵抗。“九一八”事变成为中国人民抗日战争的起点，并揭开了世界反法西斯战争的序幕。“七七”事变成为中国全民族抗战的开端，由此开辟了世界反法西斯战争的东方主战场。金寨县的抗日战争历史是中国伟大的反法西斯抗日战争的重要组成部分，也是大别山辉煌历史的一个非常重要阶段。",
            "eventTime":"1931/9-1945/8"
        }
    ],
    "ruins":[
        {
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f01Zzn.jpg","https://z3.ax1x.com/2021/08/12/f01VRs.jpg"],
            "ruinsName":"安徽抗日战争历史展馆"
        },{
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f01UL6.jpg"],
            "ruinsName":"红二十八军驻地旧址"
        }
    ]
    },{
    "id" : 4 ,
    "name" : "驱散黑暗，解放曙光",
    "events":[
        {
            "eventName":"内战爆发，中原突围",
            "eventContent":" 1946年6月，蒋介石公然撕毁停战协议，发动全面内战。解放战争的序幕由此拉开。中原军区一纵一旅在旅长皮定均的指挥下，采取“声东击西”的疑兵战术，掩护军区主力部队越过平汉路、向西前进。皮旅与主力相背而行，穿越金寨、突出重围，胜利到达苏皖解放区",
            "eventTime":"1946/6"
        },{
            "eventName":"千里跃进，解放金寨",
            "eventContent":"1947年6月至8月底，刘伯承、邓小平率领的晋冀鲁豫野战军千里跃进大别山。刘邓大军的三纵八旅攻克了金家寨，解放了流波疃、麻埠；组建了中共金寨县委和民主政府。自此，“立煌县”改名为金寨县。金寨儿女多壮志，血沃中华铸丰碑。在中国革命的各个历史时期，这里的革命红旗始终不倒、高高飘扬。这里是人民军队的重要发源地之一，在中国人民解放军的18个集团军中，至少有6个集团军有着金寨红军的血脉。金寨人民以“忠诚、奉献、紧跟党走”的精神，在中国革命的史诗中写下了壮丽的篇章！",
            "eventTime":"1947/6-1947/8"
        }
    ],
    "ruins":[
        {
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0J4un.jpg","https://z3.ax1x.com/2021/08/12/f0J5Bq.jpg","https://z3.ax1x.com/2021/08/12/f0Jfjs.jpg"],
            "ruinsName":"大别山天堂寨"
        },{
            "ruinsImage":["https://z3.ax1x.com/2021/08/12/f0GtQs.jpg","https://z3.ax1x.com/2021/08/12/f0GsW4.jpg","https://z3.ax1x.com/2021/08/12/f0GJzj.jpg"],
            "ruinsName":"刘邓大军千里跃进大别山前方指挥部"
        }
    ]
    }
]